In [181]:
import pandas as pd #tablas https://pandas.pydata.org/docs/user_guide/pyarrow.html
import numpy as np #estadistica https://numpy.org/doc/1.25/user/index.html#user
import matplotlib.pyplot as plt #gráficos https://matplotlib.org/stable/plot_types/index.html
import seaborn as sns #gráficos https://seaborn.pydata.org/tutorial/regression.html
from sklearn import linear_model #modelo de regresion https://scikit-learn.org/stable/
from sklearn.preprocessing import MinMaxScaler # do not use the function Normalise() - it does something entirely different
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.metrics import mean_absolute_error
from datetime import datetime #https://docs.python.org/3/library/datetime.html
from datetime import timedelta #this is a good time to learn about dates and timestamps. You can find some info here:
from sklearn.linear_model import LogisticRegression
from sklearn.utils import resample
from imblearn.over_sampling import SMOTE
from sklearn.metrics import confusion_matrix
from sklearn.metrics import precision_score
from sklearn.metrics import recall_score
from sklearn.metrics import f1_score
from sklearn.neighbors import KNeighborsClassifier
from scipy.stats import ttest_1samp
import scipy.stats as st
from sklearn.neighbors import KNeighborsClassifier
from mlxtend.plotting import plot_decision_regions
import pandas as pd
import numpy as np
import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication
from getpass import getpass  # To get the password without showing the input

In [182]:
exdt = pd.read_csv('expiration_date_KEY.csv')

In [183]:
exdt

    expiration_date
0        2013-01-18
1        2013-02-15
2        2013-03-15
3        2013-04-19
4        2013-05-17
..              ...
120      2023-04-21
121      2023-05-19
122      2023-06-16
123      2023-07-21
124      2023-08-18

[125 rows x 1 columns]

In [184]:
exdt['expiration_date'] = pd.to_datetime(exdt['expiration_date'])

In [185]:
exdt.dtypes

expiration_date    datetime64[ns]
dtype: object

1. raw_data --> stock_information aggregated data through expiration date

In [186]:
password = getpass()

In [187]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/raw_data'
engine = create_engine(connection_string)
query = '''SELECT * FROM stock_information;'''

stock_information = pd.read_sql_query(query, engine)

In [188]:
stock_information

,company_id,Date,Open,High,Low,Close,Adj Close,Volume
0,TSLA,2013-01-02,2.333333,2.363333,2.314000,2.357333,2.357333,17922000
1,TSLA,2013-01-03,2.345333,2.363333,2.316667,2.318000,2.318000,11130000
2,TSLA,2013-01-04,2.320000,2.320000,2.261333,2.293333,2.293333,10110000
3,TSLA,2013-01-07,2.320000,2.320000,2.260000,2.289333,2.289333,6630000
4,TSLA,2013-01-08,2.300000,2.300000,2.207333,2.245333,2.245333,19260000
...,...,...,...,...,...,...,...,...
17356,MSFT,2023-08-22,325.500000,326.079987,321.459991,322.459991,322.459991,16102000
17357,MSFT,2023-08-23,323.820007,329.200012,323.459991,327.000000,327.000000,21166400
17358,MSFT,2023-08-24,332.850006,332.980011,319.959991,319.970001,319.970001,23281400
17359,MSFT,2023-08-25,321.470001,325.359985,318.799988,322.980011,322.980011,21671400
17360,MSFT,2023-08-28,325.660004,326.149994,321.720001,323.700012,323.700012,14802100

In [189]:
tesla_stock = stock_information[stock_information['company_id'] == "TSLA"].reset_index(drop=True)

In [190]:
tesla_stock

,company_id,Date,Open,High,Low,Close,Adj Close,Volume
0,TSLA,2013-01-02,2.333333,2.363333,2.314000,2.357333,2.357333,17922000
1,TSLA,2013-01-03,2.345333,2.363333,2.316667,2.318000,2.318000,11130000
2,TSLA,2013-01-04,2.320000,2.320000,2.261333,2.293333,2.293333,10110000
3,TSLA,2013-01-07,2.320000,2.320000,2.260000,2.289333,2.289333,6630000
4,TSLA,2013-01-08,2.300000,2.300000,2.207333,2.245333,2.245333,19260000
...,...,...,...,...,...,...,...,...
2677,TSLA,2023-08-22,240.250000,240.820007,229.550003,233.190002,233.190002,130597900
2678,TSLA,2023-08-23,229.339996,238.979996,229.289993,236.860001,236.860001,101077600
2679,TSLA,2023-08-24,238.660004,238.919998,228.179993,230.039993,230.039993,99777400
2680,TSLA,2023-08-25,231.309998,239.000000,230.350006,238.589996,238.589996,106345900
2681,TSLA,2023-08-28,242.580002,244.380005,235.350006,238.820007,238.820007,107463700

In [191]:
tesla_stock['Date'] = pd.to_datetime(tesla_stock['Date'])

In [192]:
tesla_stock.head()

,company_id,Date,Open,High,Low,Close,Adj Close,Volume
0,TSLA,2013-01-02,2.333333,2.363333,2.314000,2.357333,2.357333,17922000
1,TSLA,2013-01-03,2.345333,2.363333,2.316667,2.318000,2.318000,11130000
2,TSLA,2013-01-04,2.320000,2.320000,2.261333,2.293333,2.293333,10110000
3,TSLA,2013-01-07,2.320000,2.320000,2.260000,2.289333,2.289333,6630000
4,TSLA,2013-01-08,2.300000,2.300000,2.207333,2.245333,2.245333,19260000

In [193]:
tesla_stock.dtypes

company_id            object
Date          datetime64[ns]
Open                 float64
High                 float64
Low                  float64
Close                float64
Adj Close            float64
Volume                 int64
dtype: object

In [194]:
#Columns to keep: company_id, Date, Close, Volume 
#Important to keep Date: 2013-01-02 and Open 2013-01-02

3 steps: 

1. create table only with the stocks on the value with expiration dates. Opening price for the period = closing price of the previous period. Closing price = closing price on the expiration date.

2. Sum of volume. Sum the volume between for each period.

3. Highest and lowes in the period

3. Concat the three dataframes

In [195]:
opening_closing = pd.merge(tesla_stock, exdt, left_on='Date', right_on='expiration_date', how='inner')
opening_closing  = opening_closing.drop(["Date", "Volume","High","Low","Adj Close","Close"], axis=1)
opening_closing

    company_id        Open expiration_date
0         TSLA    2.316000      2013-01-18
1         TSLA    2.566667      2013-02-15
2         TSLA    2.442667      2013-03-15
3         TSLA    3.164000      2013-04-19
4         TSLA    6.166667      2013-05-17
..         ...         ...             ...
120       TSLA  164.800003      2023-04-21
121       TSLA  177.169998      2023-05-19
122       TSLA  258.920013      2023-06-16
123       TSLA  268.000000      2023-07-21
124       TSLA  214.119995      2023-08-18

[125 rows x 3 columns]

In [196]:
opening_closing .rename(columns={'Open': 'Closing price'}, inplace=True)

In [197]:
opening_closing['Opening price'] = opening_closing['Closing price'].shift(+1)

In [198]:
opening_closing

    company_id  Closing price expiration_date  Opening price
0         TSLA       2.316000      2013-01-18            NaN
1         TSLA       2.566667      2013-02-15       2.316000
2         TSLA       2.442667      2013-03-15       2.566667
3         TSLA       3.164000      2013-04-19       2.442667
4         TSLA       6.166667      2013-05-17       3.164000
..         ...            ...             ...            ...
120       TSLA     164.800003      2023-04-21     184.520004
121       TSLA     177.169998      2023-05-19     164.800003
122       TSLA     258.920013      2023-06-16     177.169998
123       TSLA     268.000000      2023-07-21     258.920013
124       TSLA     214.119995      2023-08-18     268.000000

[125 rows x 4 columns]

In [199]:
opening_closing = opening_closing[['expiration_date'] + [col for col in opening_closing.columns if col != 'expiration_date']]
opening_closing

    expiration_date company_id  Closing price  Opening price
0        2013-01-18       TSLA       2.316000            NaN
1        2013-02-15       TSLA       2.566667       2.316000
2        2013-03-15       TSLA       2.442667       2.566667
3        2013-04-19       TSLA       3.164000       2.442667
4        2013-05-17       TSLA       6.166667       3.164000
..              ...        ...            ...            ...
120      2023-04-21       TSLA     164.800003     184.520004
121      2023-05-19       TSLA     177.169998     164.800003
122      2023-06-16       TSLA     258.920013     177.169998
123      2023-07-21       TSLA     268.000000     258.920013
124      2023-08-18       TSLA     214.119995     268.000000

[125 rows x 4 columns]

In [200]:
opening_closing["Opening price"] =opening_closing["Opening price"].fillna(2.333333)

In [201]:
opening_closing

    expiration_date company_id  Closing price  Opening price
0        2013-01-18       TSLA       2.316000       2.333333
1        2013-02-15       TSLA       2.566667       2.316000
2        2013-03-15       TSLA       2.442667       2.566667
3        2013-04-19       TSLA       3.164000       2.442667
4        2013-05-17       TSLA       6.166667       3.164000
..              ...        ...            ...            ...
120      2023-04-21       TSLA     164.800003     184.520004
121      2023-05-19       TSLA     177.169998     164.800003
122      2023-06-16       TSLA     258.920013     177.169998
123      2023-07-21       TSLA     268.000000     258.920013
124      2023-08-18       TSLA     214.119995     268.000000

[125 rows x 4 columns]

In [202]:
opening_closing ['price_change%'] = (opening_closing['Closing price'] - opening_closing['Opening price'])/(opening_closing['Opening price'])*100
opening_closing

    expiration_date company_id  Closing price  Opening price  price_change%
0        2013-01-18       TSLA       2.316000       2.333333      -0.742843
1        2013-02-15       TSLA       2.566667       2.316000      10.823273
2        2013-03-15       TSLA       2.442667       2.566667      -4.831168
3        2013-04-19       TSLA       3.164000       2.442667      29.530550
4        2013-05-17       TSLA       6.166667       3.164000      94.900980
..              ...        ...            ...            ...            ...
120      2023-04-21       TSLA     164.800003     184.520004     -10.687189
121      2023-05-19       TSLA     177.169998     164.800003       7.506065
122      2023-06-16       TSLA     258.920013     177.169998      46.142132
123      2023-07-21       TSLA     268.000000     258.920013       3.506870
124      2023-08-18       TSLA     214.119995     268.000000     -20.104479

[125 rows x 5 columns]

In [240]:
#STEP 2. VOLUME PER PERIOD

In [204]:
tesla_stock

,company_id,Date,Open,High,Low,Close,Adj Close,Volume
0,TSLA,2013-01-02,2.333333,2.363333,2.314000,2.357333,2.357333,17922000
1,TSLA,2013-01-03,2.345333,2.363333,2.316667,2.318000,2.318000,11130000
2,TSLA,2013-01-04,2.320000,2.320000,2.261333,2.293333,2.293333,10110000
3,TSLA,2013-01-07,2.320000,2.320000,2.260000,2.289333,2.289333,6630000
4,TSLA,2013-01-08,2.300000,2.300000,2.207333,2.245333,2.245333,19260000
...,...,...,...,...,...,...,...,...
2677,TSLA,2023-08-22,240.250000,240.820007,229.550003,233.190002,233.190002,130597900
2678,TSLA,2023-08-23,229.339996,238.979996,229.289993,236.860001,236.860001,101077600
2679,TSLA,2023-08-24,238.660004,238.919998,228.179993,230.039993,230.039993,99777400
2680,TSLA,2023-08-25,231.309998,239.000000,230.350006,238.589996,238.589996,106345900
2681,TSLA,2023-08-28,242.580002,244.380005,235.350006,238.820007,238.820007,107463700

In [205]:
exdt

    expiration_date
0        2013-01-18
1        2013-02-15
2        2013-03-15
3        2013-04-19
4        2013-05-17
..              ...
120      2023-04-21
121      2023-05-19
122      2023-06-16
123      2023-07-21
124      2023-08-18

[125 rows x 1 columns]

In [206]:
stock_exp = tesla_stock.copy()

In [207]:
stock_exp

,company_id,Date,Open,High,Low,Close,Adj Close,Volume
0,TSLA,2013-01-02,2.333333,2.363333,2.314000,2.357333,2.357333,17922000
1,TSLA,2013-01-03,2.345333,2.363333,2.316667,2.318000,2.318000,11130000
2,TSLA,2013-01-04,2.320000,2.320000,2.261333,2.293333,2.293333,10110000
3,TSLA,2013-01-07,2.320000,2.320000,2.260000,2.289333,2.289333,6630000
4,TSLA,2013-01-08,2.300000,2.300000,2.207333,2.245333,2.245333,19260000
...,...,...,...,...,...,...,...,...
2677,TSLA,2023-08-22,240.250000,240.820007,229.550003,233.190002,233.190002,130597900
2678,TSLA,2023-08-23,229.339996,238.979996,229.289993,236.860001,236.860001,101077600
2679,TSLA,2023-08-24,238.660004,238.919998,228.179993,230.039993,230.039993,99777400
2680,TSLA,2023-08-25,231.309998,239.000000,230.350006,238.589996,238.589996,106345900
2681,TSLA,2023-08-28,242.580002,244.380005,235.350006,238.820007,238.820007,107463700

In [ ]:
vol_exp = stock_exp.merge(exdt, how='left', left_on='Date', right_on='expiration_date')

In [242]:
vol_exp.head(15)

,company_id,Date,Open,High,Low,Close,Adj Close,Volume,expiration_date
0,TSLA,2013-01-02,2.333333,2.363333,2.314000,2.357333,2.357333,17922000,NaT
1,TSLA,2013-01-03,2.345333,2.363333,2.316667,2.318000,2.318000,11130000,NaT
2,TSLA,2013-01-04,2.320000,2.320000,2.261333,2.293333,2.293333,10110000,NaT
3,TSLA,2013-01-07,2.320000,2.320000,2.260000,2.289333,2.289333,6630000,NaT
4,TSLA,2013-01-08,2.300000,2.300000,2.207333,2.245333,2.245333,19260000,NaT
5,TSLA,2013-01-09,2.267333,2.279333,2.226667,2.242667,2.242667,10470000,NaT
6,TSLA,2013-01-10,2.258000,2.266000,2.225333,2.235333,2.235333,13837500,NaT
7,TSLA,2013-01-11,2.269333,2.269333,2.140667,2.194000,2.194000,23448000,NaT
8,TSLA,2013-01-14,2.205333,2.225333,2.190000,2.217333,2.217333,13876500,NaT
9,TSLA,2013-01-15,2.207333,2.283333,2.205333,2.260000,2.260000,24363000,NaT
10,TSLA,2013-01-16,2.256667,2.282000,2.248667,2.273333,2.273333,20673000,NaT
11,TSLA,2013-01-17,2.277333,2.323333,2.261333,2.292000,2.292000,21550500,NaT
12,TSLA,2013-01-18,2.316000,2.318667,2.254667,2.301333,2.301333,53326500,2013-01-18
13,TSLA,2013-01-22,2.304000,2.370000,2.284000,2.346000,2.346000,28803000,NaT
14,TSLA,2013-01-23,2.334667,2.416000,2.330667,2.400000,2.400000,23464500,NaT

In [243]:
vol_exp["Volume"].head(13)

0     17922000
1     11130000
2     10110000
3      6630000
4     19260000
5     10470000
6     13837500
7     23448000
8     13876500
9     24363000
10    20673000
11    21550500
12    53326500
Name: Volume, dtype: int64

In [211]:
vol_exp["Volume"].head(14).sum()

275400000

In [212]:
vol_exp[vol_exp['expiration_date'] == '2013-02-15']

,company_id,Date,Open,High,Low,Close,Adj Close,Volume,expiration_date
31,TSLA,2013-02-15,2.566667,2.567333,2.463333,2.469333,2.469333,30264000,2013-02-15

In [213]:
expiration_indices = vol_exp[vol_exp['expiration_date'].notnull()].index

In [214]:
expiration_indices_1 = np.insert(expiration_indices, 0, 0)
expiration_indices_1

Int64Index([   0,   12,   31,   50,   74,   94,  118,  137,  157,  181,
            ...
            2489, 2508, 2530, 2550, 2569, 2593, 2613, 2632, 2655, 2675],
           dtype='int64', length=126)

In [215]:
def convert_to_ranges(index_array):
    ranges = []
    start_index = index_array[0]
    for i in range(1, len(index_array)):
        ranges.append((start_index, index_array[i]+1))
        start_index = index_array[i]+1
    ranges.append((start_index, index_array[-1]))
    return ranges

index_ranges = convert_to_ranges(expiration_indices_1) 
index_ranges

[(0, 13),
 (13, 32),
 (32, 51),
 (51, 75),
 (75, 95),
 (95, 119),
 (119, 138),
 (138, 158),
 (158, 182),
 (182, 202),
 (202, 222),
 (222, 246),
 (246, 264),
 (264, 287),
 (287, 307),
 (307, 346),
 (346, 370),
 (370, 389),
 (389, 409),
 (409, 433),
 (433, 453),
 (453, 478),
 (478, 497),
 (497, 515),
 (515, 538),
 (538, 558),
 (558, 577),
 (577, 597),
 (597, 621),
 (621, 640),
 (640, 665),
 (665, 684),
 (684, 704),
 (704, 729),
 (729, 748),
 (748, 766),
 (766, 789),
 (789, 809),
 (809, 828),
 (828, 853),
 (853, 872),
 (872, 891),
 (891, 916),
 (916, 935),
 (935, 960),
 (960, 980),
 (980, 999),
 (999, 1021),
 (1021, 1041),
 (1041, 1060),
 (1060, 1084),
 (1084, 1104),
 (1104, 1123),
 (1123, 1147),
 (1147, 1167),
 (1167, 1186),
 (1186, 1211),
 (1211, 1231),
 (1231, 1250),
 (1250, 1272),
 (1272, 1292),
 (1292, 1311),
 (1311, 1335),
 (1335, 1355),
 (1355, 1374),
 (1374, 1398),
 (1398, 1418),
 (1418, 1442),
 (1442, 1462),
 (1462, 1482),
 (1482, 1505),
 (1505, 1523),
 (1523, 1542),
 (1542, 1561),
 (1561, 1605),
 (1605, 1629),
 (1629, 1648),
 (1648, 1668),
 (1668, 1692),
 (1692, 1712),
 (1712, 1732),
 (1732, 1756),
 (1756, 1774),
 (1774, 1797),
 (1797, 1817),
 (1817, 1836),
 (1836, 1856),
 (1856, 1880),
 (1880, 1899),
 (1899, 1924),
 (1924, 1943),
 (1943, 1963),
 (1963, 1988),
 (1988, 2007),
 (2007, 2025),
 (2025, 2048),
 (2048, 2068),
 (2068, 2087),
 (2087, 2112),
 (2112, 2131),
 (2131, 2150),
 (2150, 2175),
 (2175, 2194),
 (2194, 2214),
 (2214, 2239),
 (2239, 2258),
 (2258, 2281),
 (2281, 2301),
 (2301, 2320),
 (2320, 2364),
 (2364, 2383),
 (2383, 2401),
 (2401, 2426),
 (2426, 2445),
 (2445, 2470),
 (2470, 2490),
 (2490, 2509),
 (2509, 2531),
 (2531, 2551),
 (2551, 2570),
 (2570, 2594),
 (2594, 2614),
 (2614, 2633),
 (2633, 2656),
 (2656, 2676),
 (2676, 2675)]

In [239]:
vol_exp.iloc[916:935]

,company_id,Date,Open,High,Low,Close,Adj Close,Volume,expiration_date
916,TSLA,2016-08-22,14.944667,15.007333,14.845333,14.862000,14.862000,30982500,NaT
917,TSLA,2016-08-23,14.954667,15.232667,14.853333,14.989333,14.989333,71766000,NaT
918,TSLA,2016-08-24,15.136667,15.143333,14.814667,14.841333,14.841333,38560500,NaT
919,TSLA,2016-08-25,14.874000,14.920000,14.718000,14.730667,14.730667,26437500,NaT
920,TSLA,2016-08-26,14.809333,14.857333,14.588000,14.666000,14.666000,33585000,NaT
921,TSLA,2016-08-29,14.676667,14.693333,14.333333,14.346667,14.346667,48994500,NaT
922,TSLA,2016-08-30,14.407333,14.407333,14.034667,14.089333,14.089333,47533500,NaT
923,TSLA,2016-08-31,14.028667,14.173333,13.910000,14.134000,14.134000,49147500,NaT
924,TSLA,2016-09-01,13.934000,14.073333,13.366667,13.384667,13.384667,119146500,NaT
925,TSLA,2016-09-02,13.488667,13.546667,13.080000,13.185333,13.185333,89661000,NaT
926,TSLA,2016-09-06,13.268000,13.550000,13.266667,13.522000,13.522000,65859000,NaT
927,TSLA,2016-09-07,13.700000,13.766667,13.380667,13.447333,13.447333,54613500,NaT
928,TSLA,2016-09-08,13.303333,13.326000,13.090667,13.157333,13.157333,50668500,NaT
929,TSLA,2016-09-09,13.272667,13.328000,12.913333,12.964667,12.964667,56355000,NaT
930,TSLA,2016-09-12,13.000000,13.424667,12.940000,13.220000,13.220000,55728000,NaT
931,TSLA,2016-09-13,13.137333,13.232667,12.896667,13.070000,13.070000,53841000,NaT
932,TSLA,2016-09-14,13.050000,13.194667,12.990667,13.094000,13.094000,33817500,NaT
933,TSLA,2016-09-15,13.099333,13.501333,13.093333,13.361333,13.361333,46158000,NaT
934,TSLA,2016-09-16,13.361333,13.713333,13.266667,13.693333,13.693333,46617000,2016-09-16

In [217]:
volume_sums = [vol_exp.loc[start:end, 'Volume'].sum() for start, end in index_ranges]

In [218]:
volume_sums

[275400000,
 479959500,
 688348500,
 1075051500,
 3529420500,
 4234920000,
 3073686000,
 3218902500,
 3846270000,
 3296887500,
 4497525000,
 4386268500,
 2433082500,
 3063604500,
 3336790500,
 4687759500,
 2094517500,
 1657302000,
 1782960000,
 2191404000,
 2102355000,
 2267908500,
 1827427500,
 1271158500,
 1766719500,
 1726930500,
 1425982500,
 1641909000,
 1128852000,
 1113658500,
 1844956500,
 1350138000,
 1379361000,
 1678672500,
 877605000,
 979369500,
 2113557000,
 1521979500,
 2083095000,
 1906204500,
 1106148000,
 1774683000,
 1104397500,
 1053964500,
 1316847000,
 1596067500,
 1225009500,
 1738321500,
 1511488500,
 1752295500,
 2196466500,
 1989336000,
 2548267500,
 3224571000,
 2196570000,
 1429183500,
 2259102000,
 2272926000,
 1764240000,
 1959000000,
 1828470000,
 1676326500,
 3838261500,
 2115907500,
 2815195500,
 3337456500,
 3879126000,
 3414445500,
 3406471500,
 3196902000,
 2508937500,
 2273028000,
 2168514000,
 3062331000,
 7172274000,
 4884058500,
 2367982500,
 2407869000,
 2176446000,
 2515047000,
 3193572000,
 3385689000,
 4781217000,
 8457163500,
 6155365500,
 5432445000,
 5265264000,
 4258597500,
 4669023000,
 5570349000,
 5435491800,
 3451114800,
 2685073200,
 3582927900,
 2399756100,
 1751997600,
 2773312800,
 2021064000,
 2526733800,
 1420683600,
 1399726800,
 1511232300,
 1036632300,
 1212360300,
 2589150300,
 1447029300,
 1927952400,
 1714836600,
 1575738900,
 3715194300,
 1920427800,
 1711525500,
 2215947900,
 1152760200,
 2000134800,
 1835477600,
 2069765600,
 4207833800,
 4353905900,
 3098313700,
 3297880900,
 2513876000,
 3101961400,
 3352898900,
 2235791900,
 0]

In [219]:
volume_sums = volume_sums[:-1]

In [220]:
volume_stock_exdt = exdt.copy()
volume_stock_exdt

    expiration_date
0        2013-01-18
1        2013-02-15
2        2013-03-15
3        2013-04-19
4        2013-05-17
..              ...
120      2023-04-21
121      2023-05-19
122      2023-06-16
123      2023-07-21
124      2023-08-18

[125 rows x 1 columns]

In [221]:
volume_stock_exdt["volume_sum"] = volume_sums

In [222]:
volume_stock_exdt

    expiration_date  volume_sum
0        2013-01-18   275400000
1        2013-02-15   479959500
2        2013-03-15   688348500
3        2013-04-19  1075051500
4        2013-05-17  3529420500
..              ...         ...
120      2023-04-21  3297880900
121      2023-05-19  2513876000
122      2023-06-16  3101961400
123      2023-07-21  3352898900
124      2023-08-18  2235791900

[125 rows x 2 columns]

In [223]:
# MAX AND MIN PER PERIOD

In [224]:
index_ranges

[(0, 13),
 (13, 32),
 (32, 51),
 (51, 75),
 (75, 95),
 (95, 119),
 (119, 138),
 (138, 158),
 (158, 182),
 (182, 202),
 (202, 222),
 (222, 246),
 (246, 264),
 (264, 287),
 (287, 307),
 (307, 346),
 (346, 370),
 (370, 389),
 (389, 409),
 (409, 433),
 (433, 453),
 (453, 478),
 (478, 497),
 (497, 515),
 (515, 538),
 (538, 558),
 (558, 577),
 (577, 597),
 (597, 621),
 (621, 640),
 (640, 665),
 (665, 684),
 (684, 704),
 (704, 729),
 (729, 748),
 (748, 766),
 (766, 789),
 (789, 809),
 (809, 828),
 (828, 853),
 (853, 872),
 (872, 891),
 (891, 916),
 (916, 935),
 (935, 960),
 (960, 980),
 (980, 999),
 (999, 1021),
 (1021, 1041),
 (1041, 1060),
 (1060, 1084),
 (1084, 1104),
 (1104, 1123),
 (1123, 1147),
 (1147, 1167),
 (1167, 1186),
 (1186, 1211),
 (1211, 1231),
 (1231, 1250),
 (1250, 1272),
 (1272, 1292),
 (1292, 1311),
 (1311, 1335),
 (1335, 1355),
 (1355, 1374),
 (1374, 1398),
 (1398, 1418),
 (1418, 1442),
 (1442, 1462),
 (1462, 1482),
 (1482, 1505),
 (1505, 1523),
 (1523, 1542),
 (1542, 1561),
 (1561, 1605),
 (1605, 1629),
 (1629, 1648),
 (1648, 1668),
 (1668, 1692),
 (1692, 1712),
 (1712, 1732),
 (1732, 1756),
 (1756, 1774),
 (1774, 1797),
 (1797, 1817),
 (1817, 1836),
 (1836, 1856),
 (1856, 1880),
 (1880, 1899),
 (1899, 1924),
 (1924, 1943),
 (1943, 1963),
 (1963, 1988),
 (1988, 2007),
 (2007, 2025),
 (2025, 2048),
 (2048, 2068),
 (2068, 2087),
 (2087, 2112),
 (2112, 2131),
 (2131, 2150),
 (2150, 2175),
 (2175, 2194),
 (2194, 2214),
 (2214, 2239),
 (2239, 2258),
 (2258, 2281),
 (2281, 2301),
 (2301, 2320),
 (2320, 2364),
 (2364, 2383),
 (2383, 2401),
 (2401, 2426),
 (2426, 2445),
 (2445, 2470),
 (2470, 2490),
 (2490, 2509),
 (2509, 2531),
 (2531, 2551),
 (2551, 2570),
 (2570, 2594),
 (2594, 2614),
 (2614, 2633),
 (2633, 2656),
 (2656, 2676),
 (2676, 2675)]

MAX

In [225]:
max_per_period = [vol_exp.loc[start:end, 'High'].max() for start, end in index_ranges]

In [226]:
max_per_period

[2.37,
 2.666667,
 2.643333,
 3.346667,
 6.474667,
 7.66,
 8.884,
 10.592,
 12.388667,
 12.966667,
 12.226,
 10.326667,
 11.819333,
 14.557333,
 17.666668,
 15.715333,
 15.932667,
 16.299334,
 17.817333,
 19.427999,
 17.702667,
 17.332666,
 16.648001,
 15.233333,
 15.032,
 14.546667,
 14.2,
 16.66,
 17.626667,
 19.110001,
 19.110001,
 18.104668,
 18.104668,
 15.638667,
 15.906667,
 16.242001,
 14.031333,
 15.992,
 17.955999,
 17.220667,
 16.056667,
 15.166667,
 15.775333,
 15.232667,
 14.378,
 14.246667,
 13.63,
 16.726,
 19.159332,
 18.896667,
 20.915333,
 21.844,
 25.616667,
 25.799334,
 24.666668,
 25.974001,
 25.974001,
 23.33,
 23.162666,
 23.855333,
 24.033333,
 23.999332,
 21.496,
 20.865999,
 24.915333,
 24.915333,
 25.830667,
 21.821333,
 21.122667,
 24.450001,
 25.299334,
 23.466667,
 21.615999,
 21.333332,
 19.744667,
 15.649333,
 17.476667,
 17.738001,
 16.9,
 17.652,
 23.755333,
 28.134001,
 36.571999,
 64.599335,
 57.566666,
 51.663334,
 57.987999,
 68.498665,
 119.666,
 141.933334,
 167.496674,
 155.300003,
 175.333328,
 231.666672,
 294.829987,
 300.133331,
 256.166656,
 260.263336,
 251.256668,
 211.863327,
 233.333328,
 243.300003,
 254.816666,
 291.753326,
 414.496674,
 400.649994,
 402.666656,
 329.230011,
 314.283325,
 384.290009,
 264.209991,
 254.979996,
 314.666656,
 309.839996,
 313.799988,
 237.399994,
 198.919998,
 155.25,
 217.649994,
 211.229996,
 207.789993,
 189.320007,
 274.75,
 299.290009,
 272.899994,
 nan]

In [227]:
max_per_period
max_per_period = max_per_period[:-1]

MIN

In [228]:
min_per_period = [vol_exp.loc[start:end, 'Low'].min() for start, end in index_ranges]

In [229]:
min_per_period
min_per_period = min_per_period[:-1]

Append to the sum of volumes and then concat with the stock price information to finish

In [230]:
volume_stock_exdt["max_period"] = max_per_period

In [231]:
volume_stock_exdt["min_period"] = min_per_period

In [232]:
volume_stock_exdt

    expiration_date  volume_sum  max_period  min_period
0        2013-01-18   275400000    2.370000    2.140667
1        2013-02-15   479959500    2.666667    2.284000
2        2013-03-15   688348500    2.643333    2.253333
3        2013-04-19  1075051500    3.346667    2.328000
4        2013-05-17  3529420500    6.474667    3.183333
..              ...         ...         ...         ...
120      2023-04-21  3297880900  207.789993  158.610001
121      2023-05-19  2513876000  189.320007  152.369995
122      2023-06-16  3101961400  274.750000  178.220001
123      2023-07-21  3352898900  299.290009  240.699997
124      2023-08-18  2235791900  272.899994  212.360001

[125 rows x 4 columns]

In [233]:
opening_closing

    expiration_date company_id  Closing price  Opening price  price_change%
0        2013-01-18       TSLA       2.316000       2.333333      -0.742843
1        2013-02-15       TSLA       2.566667       2.316000      10.823273
2        2013-03-15       TSLA       2.442667       2.566667      -4.831168
3        2013-04-19       TSLA       3.164000       2.442667      29.530550
4        2013-05-17       TSLA       6.166667       3.164000      94.900980
..              ...        ...            ...            ...            ...
120      2023-04-21       TSLA     164.800003     184.520004     -10.687189
121      2023-05-19       TSLA     177.169998     164.800003       7.506065
122      2023-06-16       TSLA     258.920013     177.169998      46.142132
123      2023-07-21       TSLA     268.000000     258.920013       3.506870
124      2023-08-18       TSLA     214.119995     268.000000     -20.104479

[125 rows x 5 columns]

In [234]:
filtered_stock_tesla = pd.merge(opening_closing, volume_stock_exdt, on='expiration_date', how='outer')

In [235]:
filtered_stock_tesla

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period
0,2013-01-18,TSLA,2.316000,2.333333,-0.742843,275400000,2.370000,2.140667
1,2013-02-15,TSLA,2.566667,2.316000,10.823273,479959500,2.666667,2.284000
2,2013-03-15,TSLA,2.442667,2.566667,-4.831168,688348500,2.643333,2.253333
3,2013-04-19,TSLA,3.164000,2.442667,29.530550,1075051500,3.346667,2.328000
4,2013-05-17,TSLA,6.166667,3.164000,94.900980,3529420500,6.474667,3.183333
...,...,...,...,...,...,...,...,...
120,2023-04-21,TSLA,164.800003,184.520004,-10.687189,3297880900,207.789993,158.610001
121,2023-05-19,TSLA,177.169998,164.800003,7.506065,2513876000,189.320007,152.369995
122,2023-06-16,TSLA,258.920013,177.169998,46.142132,3101961400,274.750000,178.220001
123,2023-07-21,TSLA,268.000000,258.920013,3.506870,3352898900,299.290009,240.699997
124,2023-08-18,TSLA,214.119995,268.000000,-20.104479,2235791900,272.899994,212.360001

In [236]:
filtered_stock_tesla ['max-min%'] = (filtered_stock_tesla['max_period'] - filtered_stock_tesla['min_period'])/(filtered_stock_tesla['min_period'])*100
filtered_stock_tesla

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period,max-min%
0,2013-01-18,TSLA,2.316000,2.333333,-0.742843,275400000,2.370000,2.140667,10.713156
1,2013-02-15,TSLA,2.566667,2.316000,10.823273,479959500,2.666667,2.284000,16.754247
2,2013-03-15,TSLA,2.442667,2.566667,-4.831168,688348500,2.643333,2.253333,17.307695
3,2013-04-19,TSLA,3.164000,2.442667,29.530550,1075051500,3.346667,2.328000,43.757174
4,2013-05-17,TSLA,6.166667,3.164000,94.900980,3529420500,6.474667,3.183333,103.392702
...,...,...,...,...,...,...,...,...,...
120,2023-04-21,TSLA,164.800003,184.520004,-10.687189,3297880900,207.789993,158.610001,31.006867
121,2023-05-19,TSLA,177.169998,164.800003,7.506065,2513876000,189.320007,152.369995,24.250189
122,2023-06-16,TSLA,258.920013,177.169998,46.142132,3101961400,274.750000,178.220001,54.163393
123,2023-07-21,TSLA,268.000000,258.920013,3.506870,3352898900,299.290009,240.699997,24.341509
124,2023-08-18,TSLA,214.119995,268.000000,-20.104479,2235791900,272.899994,212.360001,28.508190

SENDING IT TO MY SQL MUSK_TWT_TESLA_STOCK

In [237]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/musk_twt_tesla_stock'
engine = create_engine(connection_string)

In [238]:
#filtered_stock_tesla.to_sql('filtered_stock_tesla', engine, if_exists='append', index=False)

125